docs/campana/mutantes/H-caja-esperado-cruza-vendedor.patch
diff --git b/apps/kilopan/src/app/api/cierre-caja/route.ts a/apps/kilopan/src/app/api/cierre-caja/route.ts
index d896332..8f79dbc 100644
--- b/apps/kilopan/src/app/api/cierre-caja/route.ts
+++ a/apps/kilopan/src/app/api/cierre-caja/route.ts
@@ -149,9 +149,8 @@ export async function POST(request: NextRequest) {
         const esperado = await tx.query<{ esperado: string }>(
           // AC-ADM-05: la venta anulada no cuenta en lo esperado del cierre.
           `select coalesce(sum(total_clp), 0)::text as esperado from pan.ventas
-            where medio_pago = $1 and dispositivo_id = $2 and creado_at >= date_trunc('day', $3::timestamptz)
-              and anulada_at is null`, // MUTANTE: trunca a inicio del DÍA, no del turno
-
+            where medio_pago = $1 and dispositivo_id = $2 and creado_at >= $3
+              and anulada_at is null`,
           [d.medioPago, sesion.dispositivoId, turno.abierto_at]
         );
         const esperadoClp = Number(esperado.rows[0]?.esperado ?? 0);
